In [1]:
import numpy as np 
import pandas as pd

In [2]:
import pandas as pd

df = pd.read_csv("spam.csv", encoding="latin-1")
# or
# df = pd.read_csv("spam.csv", encoding="ISO-8859-1")
# df = pd.read_csv("spam.csv", encoding="cp1252")

print(df.head())

     v1                                                 v2 Unnamed: 2  \
0   ham  Go until jurong point, crazy.. Available only ...        NaN
1   ham                      Ok lar... Joking wif u oni...        NaN
2  spam  Free entry in 2 a wkly comp to win FA Cup fina...        NaN
3   ham  U dun say so early hor... U c already then say...        NaN
4   ham  Nah I don't think he goes to usf, he lives aro...        NaN

  Unnamed: 3 Unnamed: 4
0        NaN        NaN
1        NaN        NaN
2        NaN        NaN
3        NaN        NaN
4        NaN        NaN

In [3]:
df.head()

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,ham,"Go until jurong point, crazy.. Available only ...",NaN,NaN,NaN
1,ham,Ok lar... Joking wif u oni...,NaN,NaN,NaN
2,spam,Free entry in 2 a wkly comp to win FA Cup fina...,NaN,NaN,NaN
3,ham,U dun say so early hor... U c already then say...,NaN,NaN,NaN
4,ham,"Nah I don't think he goes to usf, he lives aro...",NaN,NaN,NaN

In [4]:
df.sample(5)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
1253,ham,Mum say we wan to go then go... Then she can s...,NaN,NaN,NaN
4931,ham,Match started.india &lt;#&gt; for 2,NaN,NaN,NaN
5163,ham,Ok leave no need to ask,NaN,NaN,NaN
3460,ham,K.. I yan jiu liao... Sat we can go 4 bugis vi...,NaN,NaN,NaN
1938,ham,Excellent! Are you ready to moan and scream in...,NaN,NaN,NaN

In [5]:
df.shape

(5572, 5)

Data Cleaning

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [7]:
df.drop(columns=['Unnamed: 2' ,'Unnamed: 3' ,'Unnamed: 4'], inplace=True)

In [8]:
df.sample

<bound method NDFrame.sample of         v1                                                 v2
0      ham  Go until jurong point, crazy.. Available only ...
1      ham                      Ok lar... Joking wif u oni...
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...
3      ham  U dun say so early hor... U c already then say...
4      ham  Nah I don't think he goes to usf, he lives aro...
...    ...                                                ...
5567  spam  This is the 2nd time we have tried 2 contact u...
5568   ham              Will Ì_ b going to esplanade fr home?
5569   ham  Pity, * was in mood for that. So...any other s...
5570   ham  The guy did some bitching but I acted like i'd...
5571   ham                         Rofl. Its true to its name

[5572 rows x 2 columns]>

In [10]:
df.rename(columns={'v1' : 'target', 'v2' :'text'}, inplace=True)
df.sample(5)

     target                                               text
4428    ham  Hey they r not watching movie tonight so i'll ...
3470    ham  Heart is empty without love.. Mind is empty wi...
2547   spam  Text82228>> Get more ringtones, logos and game...
2056    ham  .Please charge my mobile when you get up in mo...
5088    ham                             I wont do anything de.